app/Controllers/Auth.php

    public function login()
    {
        $usuarioModel = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('contraseña');

        $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuario`
WHERE `email` = 'lautaroriveros@gmail.com'
 LIMIT 1