app/Controllers/carritoProducto_controller.php

DELETE FROM `carritoproducto`
WHERE `id_carrito_producto` IN ('31')
---
    public function eliminar()
    {
        $id = $this->request->getPost('id_carrito_producto');

        $model = new CarritoProductoModel();
        $model->delete($id);