app/Controllers/Catalogo.php

SELECT *
FROM `producto`
WHERE `producto`.`id_producto` = '2'
---
                    ->findAll();

                foreach ($items as &$item) {
                    $producto = $productoModel->find($item['id_producto']);