app/Controllers/consulta_controller.php

INSERT INTO `consulta` (`nombre`, `email`, `telefono`, `mensaje`, `fecha_envio`) VALUES ('Sabrina', 'turtolasabrina@gmail.com', '3794282166', 'pruebaaaaaaaaaaaaaaa', '2025-06-12 18:56:05')
---
    public function guardar()
    {
        $validation = \Config\Services::validation();

        $data = [
            'nombre'      => $this->request->getPost('nombre'),
            'email'       => $this->request->getPost('email'),
            'telefono'    => $this->request->getPost('telefono'),
            'mensaje'     => $this->request->getPost('mensaje'),
            'fecha_envio' => date('Y-m-d H:i:s'),
        ];

        if (!$this->validate([
            'nombre'  => 'required',
            'email'   => 'required|valid_email',
            'mensaje' => 'required',
        ])) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        $model = new consultaModel();
        $model->insert($data);