app/Controllers/producto_controller.php

SELECT *
FROM `producto`
---
    public function index()
    {
        $data['productos'] = $this->productoModel->findAll();