app/Controllers/usuario_controller.php

    public function index()
    {
        if (!$this->esAdmin()) {
            return redirect()->to('/')->with('error', 'Acceso no autorizado');
        }

        $data['usuarios'] = $this->usuarioModel->findAll();
---
SELECT *
FROM `usuario`