app/Models/usuarioModel.php

    public function agregarUsuario($data)
    {
        return $this->insert($data);
---
INSERT INTO `usuario` (`nombre`, `apellido`, `email`, `telefono`, `contraseña`, `rol`) VALUES ('Lautaro', 'Riveros', 'riverloslautaro@gmail.com', '', '$2y$10$WabK9/cfYFz2bgk.DSap/.K71QFfEeD2NxqeVvYBPi4JJAML/xoBe', 'cliente')